CREATE TABLE `edu_chapter` (
  `id` char(19) NOT NULL COMMENT '章节ID',
  `course_id` char(19) NOT NULL COMMENT '课程ID',
  `title` varchar(50) NOT NULL COMMENT '章节名称',
  `sort` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '显示排序',
  `gmt_create` datetime NOT NULL COMMENT '创建时间',
  `gmt_modified` datetime NOT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_course_id` (`course_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 ROW_FORMAT=COMPACT COMMENT='课程';

#
# Data for table "edu_chapter"
#

INSERT 
	INTO `edu_chapter` 
VALUES 
	('1','14','第一章：HTML',0,'2019-01-01 12:27:40','2019-01-01 12:55:30'),
	('1181729226915577857','18','第七章：I/O流',70,'2019-10-09 08:32:58','2019-10-09 08:33:20'),
	('1192252428399751169','1192252213659774977','第一章节',0,'2019-11-07 09:28:25','2019-11-07 09:28:25'),
	('15','18','第一章：Java入门',0,'2019-01-01 12:27:40','2019-10-09 09:13:19'),
	('3','14','第二章：CSS',0,'2019-01-01 12:55:35','2019-01-01 12:27:40'),
	('32','18','第二章：控制台输入和输出',0,'2019-01-01 12:27:40','2019-01-01 12:27:40'),
	('44','18','第三章：控制流',0,'2019-01-01 12:27:40','2019-01-01 12:27:40'),
	('48','18','第四章：类的定义',0,'2019-01-01 12:27:40','2019-01-01 12:27:40'),
	('63','18','第五章：数组',0,'2019-01-01 12:27:40','2019-01-01 12:27:40'),
	('64','18','第六章：继承',61,'2019-01-01 12:27:40','2019-10-09 08:32:47');
